|                      |       |
|----------------------|-------|
| **Time limit:**      | `1 s` |
| **Real time limit:** | `5 s` |
| **Memory limit:**    | `64M` |


### Problem sm03-3: asm/hacks/wrong-function

Студент Миша ошибся при написании своей функции `process` и забыл добавить пролог. При этом с
прологом его функция корректна и возвращает некоторое число. Но вот незадача - переписать его
исходный код вы не можете.

Напишите программу, которая вызовет функцию `int process();` ровно один раз и выведет возвращаемое
число.

Функция `process` скомпилирована в отдельной единице трансляции и не является статичной.

Для вывода используйте `printf("%d", number);`

Например, если Мишина функция такова:

    
    
    mov $4, %eax
    mov %ebp, %esp
    pop %ebp
    ret

то ваша программа должна вывести число 4.

